packages/correos/correos-0.0.6.tar.gz/correos-0.0.6/correos/template/test_connection.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://www.correos.es/iris6/services/preregistroetiquetas">
    <soapenv:Header/>
    <soapenv:Body>
        <PreregistroEnvio>
            <FechaOperacion>${now}</FechaOperacion>
            <CodEtiquetador>XXX1</CodEtiquetador>
            <Care>000000</Care>
            <TotalBultos>1</TotalBultos>
            <ModDevEtiqueta>2</ModDevEtiqueta>
            <Remitente>
                <Identificacion>
                    <Nombre>Zikzakmedia SL</Nombre>
                    <Apellido1></Apellido1>
                    <Apellido2></Apellido2>
                    <Nif>123456</Nif>
                </Identificacion>
                <DatosDireccion>
                    <Direccion>Sant Jaume 9, Baix Segona</Direccion>
                    <Numero></Numero>
                    <Piso></Piso>
                    <Puerta></Puerta>
                    <Localidad>Vilafranca del Penedes</Localidad>
                    <Provincia>Barcelona</Provincia>
                </DatosDireccion>
                <CP>08720</CP>
                <Telefonocontacto>938902108</Telefonocontacto>
                <Email>zikzak@zikzakmedia.com</Email>
                <DatosSMS>
                    <NumeroSMS>658565656</NumeroSMS>
                    <Idioma>1</Idioma>
                </DatosSMS>
            </Remitente>
            <Destinatario>
                <Identificacion>
                    <Nombre>Raimon Esteve Cusine</Nombre>
                    <Apellido1></Apellido1>
                    <Apellido2></Apellido2>
                </Identificacion>
                <DatosDireccion>
                    <Direccion>Durruti 1937, 4art 2ona</Direccion>
                    <Numero></Numero>
                    <Piso></Piso>
                    <Puerta></Puerta>
                    <Localidad>Barcelona</Localidad>
                    <Provincia>Barcelona</Provincia>
                </DatosDireccion>
                <CP>08021</CP>
                <ZIP></ZIP>
                <Pais>ES</Pais>
                <Telefonocontacto>612121212</Telefonocontacto>
                <Email>zikzak@zikzakmedia.com</Email>
                <DatosSMS>
                    <NumeroSMS>625969696</NumeroSMS>
                    <Idioma>1</Idioma>
                </DatosSMS>
            </Destinatario>
            <Envio>
                <CodProducto>S0235</CodProducto>
                <ReferenciaCliente>ZZS0001</ReferenciaCliente>
                <ReferenciaCliente2></ReferenciaCliente2>
                <TipoFranqueo>FP</TipoFranqueo>
                <ModalidadEntrega>ST</ModalidadEntrega>
                <Pesos>
                    <Peso>
                        <TipoPeso>R</TipoPeso>
                        <Valor>100</Valor>
                    </Peso>
                </Pesos>
                <Largo>1</Largo>
                <Alto>1</Alto>
                <Ancho>1</Ancho>
                <ValoresAnadidos>
                    <EntregaExclusivaDestinatario>N</EntregaExclusivaDestinatario>
                </ValoresAnadidos>
                <Observaciones1>Esto es una prueba test de conexion</Observaciones1>
                <InstruccionesDevolucion>D</InstruccionesDevolucion>
            </Envio>
        </PreregistroEnvio>
    </soapenv:Body>
</soapenv:Envelope>
